; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v12 ?v13)
             (pred_1 ?v11 ?v5)
             (pred_12 ?v12 ?v5)
             (pred_5 ?v1 ?v12 )
	     (pred_2 ?v12)
             (pred_9 ?v9)
             (pred_4 ?v11)
             (pred_10 ?v5)
             (pred_6 ?v12)
             (pred_3 ?v11)
             (pred_8 ?v12)
             (pred_7 ))



(:action op_5
:parameters (?v4 ?v3 ?v6 ?v8)
:precondition (and (pred_9 ?v4) (pred_9 ?v3) (pred_4 ?v6) (pred_10 ?v8)
          (pred_11 ?v4 ?v3) (pred_1 ?v6 ?v8)
                   (pred_12 ?v3 ?v8) (pred_2 ?v4) 
                   (pred_6 ?v3) (pred_3 ?v6))
:effect (and  (pred_8 ?v3) (not (pred_6 ?v3))))


(:action op_4
:parameters (?v4 ?v2)
:precondition (and (pred_9 ?v4) (pred_9 ?v2)
               (pred_2 ?v4) (pred_11 ?v4 ?v2) (pred_8 ?v2))
:effect (and (pred_2 ?v2) (not (pred_2 ?v4))))

(:action op_1
:parameters (?v4 ?v6)
:precondition (and (pred_9 ?v4) (pred_4 ?v6) 
                  (pred_2 ?v4) (pred_5 ?v6 ?v4) (pred_7 ))
:effect (and (pred_3 ?v6)
   (not (pred_5 ?v6 ?v4)) (not (pred_7 ))))


(:action op_3
:parameters (?v4 ?v7 ?v10)
:precondition (and (pred_9 ?v4) (pred_4 ?v7) (pred_4 ?v10)
                  (pred_2 ?v4) (pred_3 ?v10) (pred_5 ?v7 ?v4))
:effect (and (pred_3 ?v7) (pred_5 ?v10 ?v4)
        (not (pred_3 ?v10)) (not (pred_5 ?v7 ?v4))))

(:action op_2
:parameters (?v4 ?v6)
:precondition (and (pred_9 ?v4) (pred_4 ?v6) 
                  (pred_2 ?v4) (pred_3 ?v6))
:effect (and (pred_7 ) (pred_5 ?v6 ?v4) (not (pred_3 ?v6)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_14 obj_13 obj_18 obj_17 obj_11 obj_07 obj_16 obj_15 obj_05 obj_06 obj_10 obj_03 obj_19 obj_01 obj_20
    obj_08 obj_09 obj_02
    obj_04 obj_22 obj_12
    )

    (:init
       (pred_7)

       (pred_9 obj_21)
       (pred_9 obj_14)
       (pred_9 obj_13)
       (pred_9 obj_18)
       (pred_9 obj_17)
       (pred_9 obj_11)
       (pred_9 obj_07)
       (pred_9 obj_16)
       (pred_9 obj_15)
       (pred_9 obj_05)
       (pred_9 obj_06)
       (pred_9 obj_10)
       (pred_9 obj_03)
       (pred_9 obj_19)
       (pred_9 obj_01)
       (pred_9 obj_20)
       (pred_10 obj_08)
       (pred_10 obj_09)
       (pred_10 obj_02)
       (pred_4 obj_04)
       (pred_4 obj_22)
       (pred_4 obj_12)

       (pred_11 obj_21 obj_17)
       (pred_11 obj_21 obj_14)
       (pred_11 obj_14 obj_11)
       (pred_11 obj_14 obj_13)
       (pred_11 obj_14 obj_21)
       (pred_11 obj_13 obj_07)
       (pred_11 obj_13 obj_18)
       (pred_11 obj_13 obj_14)
       (pred_11 obj_18 obj_16)
       (pred_11 obj_18 obj_13)
       (pred_11 obj_17 obj_15)
       (pred_11 obj_17 obj_11)
       (pred_11 obj_17 obj_21)
       (pred_11 obj_11 obj_05)
       (pred_11 obj_11 obj_07)
       (pred_11 obj_11 obj_14)
       (pred_11 obj_11 obj_17)
       (pred_11 obj_07 obj_06)
       (pred_11 obj_07 obj_16)
       (pred_11 obj_07 obj_13)
       (pred_11 obj_07 obj_11)
       (pred_11 obj_16 obj_10)
       (pred_11 obj_16 obj_18)
       (pred_11 obj_16 obj_07)
       (pred_11 obj_15 obj_03)
       (pred_11 obj_15 obj_05)
       (pred_11 obj_15 obj_17)
       (pred_11 obj_05 obj_19)
       (pred_11 obj_05 obj_06)
       (pred_11 obj_05 obj_11)
       (pred_11 obj_05 obj_15)
       (pred_11 obj_06 obj_01)
       (pred_11 obj_06 obj_10)
       (pred_11 obj_06 obj_07)
       (pred_11 obj_06 obj_05)
       (pred_11 obj_10 obj_20)
       (pred_11 obj_10 obj_16)
       (pred_11 obj_10 obj_06)
       (pred_11 obj_03 obj_19)
       (pred_11 obj_03 obj_15)
       (pred_11 obj_19 obj_01)
       (pred_11 obj_19 obj_05)
       (pred_11 obj_19 obj_03)
       (pred_11 obj_01 obj_20)
       (pred_11 obj_01 obj_06)
       (pred_11 obj_01 obj_19)
       (pred_11 obj_20 obj_10)
       (pred_11 obj_20 obj_01)
       (pred_6 obj_06)
       (pred_6 obj_07)
       (pred_6 obj_15)
       (pred_12  obj_06 obj_08)
       (pred_12  obj_07 obj_09)
       (pred_12  obj_15 obj_02)
       (pred_8 obj_21)
       (pred_8 obj_14)
       (pred_8 obj_13)
       (pred_8 obj_18)
       (pred_8 obj_17)
       (pred_8 obj_11)
       (pred_8 obj_16)
       (pred_8 obj_05)
       (pred_8 obj_10)
       (pred_8 obj_03)
       (pred_8 obj_19)
       (pred_8 obj_01)
       (pred_8 obj_20)

       (pred_1  obj_04 obj_08)
       (pred_1  obj_22 obj_09)
       (pred_1  obj_12 obj_02)
       (pred_5 obj_04 obj_16)
       (pred_5 obj_22 obj_05)
       (pred_5 obj_12 obj_18)
       (pred_2 obj_19)
    )

    (:goal (and
       (pred_5 obj_04 obj_11)
    ))
(:constraints
  (always (not (pred_2 obj_07)))
)
)

; plan
1. (op_4 obj_19 obj_05)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_05)
   goals met: 0 of 1
2. (op_1 obj_05 obj_22)
   deleted: (pred_5 obj_22 obj_05) (pred_7)
   added: (pred_3 obj_22)
   goals met: 0 of 1
3. (op_4 obj_05 obj_11)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_11)
   goals met: 0 of 1
4. (op_5 obj_11 obj_07 obj_22 obj_09)
   deleted: (pred_6 obj_07)
   added: (pred_8 obj_07)
   goals met: 0 of 1
5. (op_2 obj_11 obj_22)
   deleted: (pred_3 obj_22)
   added: (pred_7) (pred_5 obj_22 obj_11)
   goals met: 0 of 1
6. (op_4 obj_11 obj_14)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_14)
   goals met: 0 of 1
7. (op_4 obj_14 obj_13)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_13)
   goals met: 0 of 1
8. (op_4 obj_13 obj_18)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_18)
   goals met: 0 of 1
9. (op_4 obj_18 obj_16)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_16)
   goals met: 0 of 1
10. (op_1 obj_16 obj_04)
   deleted: (pred_5 obj_04 obj_16) (pred_7)
   added: (pred_3 obj_04)
   goals met: 0 of 1
11. (op_4 obj_16 obj_18)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_18)
   goals met: 0 of 1
12. (op_4 obj_18 obj_13)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_13)
   goals met: 0 of 1
13. (op_4 obj_13 obj_14)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_14)
   goals met: 0 of 1
14. (op_4 obj_14 obj_11)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_11)
   goals met: 0 of 1
15. (op_3 obj_11 obj_22 obj_04)
   deleted: (pred_3 obj_04) (pred_5 obj_22 obj_11)
   added: (pred_3 obj_22) (pred_5 obj_04 obj_11)
   goals met: 1 of 1
